# Specify directory
cask_args appdir: "~/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "elastic/tap"
tap "sdkman/tap"

# Infrastructure
brew "postgresql@14"
brew "redis"
brew "kafka"
brew "elastic/tap/elasticsearch-full"
cask "docker"

# IDEs
cask "intellij-idea"
cask "fleet"
cask "datagrip"
cask "visual-studio-code"
cask "beekeeper-studio"

# Runtimes and runtime managers
brew "deno"
brew "pnpm"
brew "jenv"
brew "volta"

# Command line
brew "sdkman-cli"
brew "curl"
brew "git"
brew "awscli"

# Development tools
cask "postman"
cask "sourcetree"
cask "figma"

# Notes and communication
cask "notion"
cask "slack"
cask "zoom"

# Browsers
cask "google-chrome"
cask "firefox"

# Image editors
cask "gimp"
cask "inkscape"